In [1]:
import numpy as np
import pandas as pd

In [2]:
s1=pd.Series(np.arange(1,51))

In [3]:
s1.sum()

1275

In [4]:
s1.std()

14.577379737113251

In [5]:
s1.mean()

25.5

In [6]:
s1.var()

212.5

In [7]:
df1=pd.DataFrame(np.arange(36).reshape(6,6),index=list('abcdef'),columns=list(range(1,7)))

In [8]:
df1

    1   2   3   4   5   6
a   0   1   2   3   4   5
b   6   7   8   9  10  11
c  12  13  14  15  16  17
d  18  19  20  21  22  23
e  24  25  26  27  28  29
f  30  31  32  33  34  35

In [9]:
df1.iloc[1:4,0:2]=np.nan

In [10]:
df1

      1     2   3   4   5   6
a   0.0   1.0   2   3   4   5
b   NaN   NaN   8   9  10  11
c   NaN   NaN  14  15  16  17
d   NaN   NaN  20  21  22  23
e  24.0  25.0  26  27  28  29
f  30.0  31.0  32  33  34  35

In [11]:
df1.sum()

1     54.0
2     57.0
3    102.0
4    108.0
5    114.0
6    120.0
dtype: float64

In [12]:
df1.sum(axis=1)

a     15.0
b     38.0
c     62.0
d     86.0
e    159.0
f    195.0
dtype: float64

In [13]:
df1.mean(axis=1)

a     2.5
b     9.5
c    15.5
d    21.5
e    26.5
f    32.5
dtype: float64

In [14]:
df1.idxmax()           #Gives position where max value is present column wise.

1    f
2    f
3    f
4    f
5    f
6    f
dtype: object

In [15]:
df1.idxmin(axis=1)

a    1
b    3
c    3
d    3
e    1
f    1
dtype: int64

In [16]:
df1.cumprod()

     1      2        3        4         5         6
a  0.0    1.0        2        3         4         5
b  NaN    NaN       16       27        40        55
c  NaN    NaN      224      405       640       935
d  NaN    NaN     4480     8505     14080     21505
e  0.0   25.0   116480   229635    394240    623645
f  0.0  775.0  3727360  7577955  13404160  21827575

In [17]:
#For other functions see Pg.NO.160

*Correlation And Covariance*

In [18]:
df2=pd.DataFrame(np.random.randn(3,4),columns=list('abcd'))

In [19]:
df2

          a         b         c         d
0  0.772969 -0.244764 -0.759917 -3.407105
1 -1.031120 -0.120605  0.279867  1.184446
2  0.238914 -1.297454 -0.731864  1.842328

In [20]:
df2.corr()

          a         b         c         d
a  1.000000 -0.321650 -0.964142 -0.644681
b -0.321650  1.000000  0.561400 -0.516465
c -0.964142  0.561400  1.000000  0.418690
d -0.644681 -0.516465  0.418690  1.000000

In [21]:
df2.cov()

          a         b         c         d
a  0.858823 -0.192740 -0.529296 -1.708586
b -0.192740  0.418091  0.215037 -0.955028
c -0.529296  0.215037  0.350923  0.709313
d -1.708586 -0.955028  0.709313  8.178617

In [22]:
df2['a'].corr(df2['b'])

-0.3216504932647324

In [23]:
df2['a'].cov(df2['b'])

-0.19273975972271382

In [24]:
df2.corrwith(df2['c'])

a   -0.964142
b    0.561400
c    1.000000
d    0.418690
dtype: float64